Catalogs/СотрудникиАутсорсинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СотрудникиАутсорсинг</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСотрудниковАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прикреплен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мобильный</Name>
					<Comment>Дополнительный признак, для удобства построения графиков внештатными менеджерами</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПерсоналККМ</Name>
					<Comment>Код, соответствующий коду справочника Персонал ККМ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СотрудникиАутсорсинг/Forms/ФормаВыбора/Ext/Form/Module.bsl
//+++AK ziga 091117
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//+++АК mika 2018.01.15 ИП-00017263.02
	//Комментирование оригинального текста
	//ТекГруппаСотрудников = ДопМодульСервер.ПолучитьТекущуюГруппуСотрудниковАутсорсинг();   
	
	//Не сохранять отборы пользователей с полными правами	
	Список.Отбор.Элементы.Очистить(); 
	
	Если Параметры.Свойство("Должность") И ЗначениеЗаполнено(Параметры.Должность) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Должность");
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Справочники.ДолжностиВнештатныхСотрудников.НайтиПоНаименованию(Параметры.Должность);
		
		Если Не РольДоступна("ПолныеПрава") Тогда
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;

	КонецЕсли;
	
	Если Параметры.Свойство("ОтветственныйМенеджер") И ЗначениеЗаполнено(Параметры.ОтветственныйМенеджер) Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОтветственныйМенеджер");
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Параметры.ОтветственныйМенеджер;
		
		Если Не РольДоступна("ПолныеПрава") Тогда
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;

	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийКонтрагент") Тогда
		ГруппаСотрудников = Справочники.СотрудникиАутсорсинг.ПолучитьГруппуСотрудниковПоКонтрагенту(Параметры.ТекущийКонтрагент);
	ИначеЕсли Параметры.Свойство("ГруппаСотрудников") Тогда
		ГруппаСотрудников = Параметры.ГруппаСотрудников;
	Иначе
		ГруппаСотрудников = ДопМодульСервер.ПолучитьТекущуюГруппуСотрудниковАутсорсинг();
	КонецЕсли;
	
	Если НЕ ГруппаСотрудников = Неопределено Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ГруппаСотрудников");
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ГруппаСотрудников;
		
		Если Не РольДоступна("ПолныеПрава") Тогда
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат;

	//---АК mika ИП-00017263.02
	
	Если НЕ ГруппаСотрудников = Неопределено Тогда
		
		ОтборНаФорме = ЭтаФорма.Список.Отбор;
		ПолеКомпоновкиГруппаСотрудников = Новый ПолеКомпоновкиДанных("ГруппаСотрудников");
			
		Если ОтборНаФорме.Элементы.Количество() = 0 Тогда
			
			ЭлементОтбора = ОтборНаФорме.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение 	= ПолеКомпоновкиГруппаСотрудников;
			ЭлементОтбора.Использование 	= Истина;
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение 	= ГруппаСотрудников;
			//+++Ak ziga  20171119 Ип-00017049
			Если Не РольДоступна("ПолныеПрава") Тогда
			ЭлементОтбора.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;
			//---Ak ziga  20171119 Ип-0001704
		Иначе
			
			Для Каждого ЭлементОтбора Из ОтборНаФорме.Элементы Цикл
				
				Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиГруппаСотрудников Тогда
					
					ЭлементОтбора.ПравоеЗначение = ГруппаСотрудников;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	//ЭлементОтбора = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ПолеКомпоновкиМенеджер = Новый ПолеКомпоновкиДанных("Должность");
	//ЭлементОтбора.ЛевоеЗначение 	= ПолеКомпоновкиМенеджер;
	//ЭлементОтбора.Использование 	= Истина;
	//ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение 	= Справочники.ДолжностиВнештатныхСотрудников.НайтиПоНаименованию("Менеджер");


КонецПроцедуры
//---ak ziga
